# Rebar Bar Type Get Crank Angled Length Method

Source: https://www.revitapidocs.com/2026/32bf48bd-00b5-5b77-f811-bb16748c557e.htm

---

| Rebar Bar Type Get Crank Angled Length Method |
| --- |

Gets the crank angled length taking into account the specified Rebar Crank Type.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double GetCrankAngledLength(
	ElementId rebarCrankTypeId
)
```

```
Public Function GetCrankAngledLength (
	rebarCrankTypeId As ElementId
) As Double
```

```
public:
double GetCrankAngledLength(
	ElementId^ rebarCrankTypeId
)
```

```
member GetCrankAngledLength :
        rebarCrankTypeId : ElementId -> float
```

#### Parameters

rebarCrankTypeId ElementId
:   The Rebar Crank Type id.
 Interactions with Rebar Crank Types can be done with the functions in \[!:Autodesk::Revit::DB::Structure::RebarCrankTypeUtils] .

#### Return Value

Double
Returns the crank angled length. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | The rebarCrankTypeId doesn't represent a valid Rebar Crank Type. It should be an ElementType of BuiltInCategory.OST\_RebarCrankType category. |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

RebarBarType Class Autodesk.Revit.DB.Structure Namespace